package com.zhai.shuyangwx.bean;

import org.greenrobot.greendao.annotation.Entity;
import org.greenrobot.greendao.annotation.Id;

/**
 * Created by zhaiyang on 2018/6/4.
 */

public class ChapterRead {

    /**
     * ok : true
     * chapter : {"title":".","body":"\u201c哈哈，你们看，这个傻子，又在这里坐了一天，我看他是真的傻了吧？\u201d\n\u201c本来就傻，要不是傻，又怎么会损害自己的修为去帮助李月茹驱除体内的火毒呢。\u201d\n\u201c唉，可惜了，曾经我们黑水宗外宗的第一天才，如今却这副痴呆的模样。\u201d\n周围，路过不少人，正对着一个坐在一块青石上，闭目养神的黑衣少年指指点点。、\n少年今年十四岁。\n曾经黑水宗外宗的第一天才。\n都说他以后，会是整个黑水宗继李天都后，第四个可以成为黑水宗圣徒的人。\n可惜。\n一年前的外宗第一天才，却为了区区一个李月茹，硬是放弃了自己的大好前程，以消耗自己真元为代价，帮助李月茹驱除体内的毒火。\n一年下来。\n他的修为，从一年前的锻体六重天巅峰，已经降落至了如今的锻体一重天。\n不仅如此，资质也从以前的一元境。成为了一个资质下等的愚夫。\n可谓是从云端跌落在了泥土里。\n成为了整个外宗所有人的笑柄。都认为他色迷心窍，是个十足的傻子。\n但叶飞却浑然不觉。\n为了自己心爱的女人，他什么都可以做。\n\u201c哈哈哈，破而后立，我还差一丝，就可以彻底的领悟出\u2018洪荒元尊霸体诀\u2019，打开第一道元尊神门，滋养出一丝元尊之力。\u201d忽然，叶飞站起身来，脸色大喜，心头肆意的大笑了起来。\n没有人知道。\n在两年前，他融合了一尊无上存在的记忆，从那里面，得到了一篇盖世武学。\n这盖世武学，名为洪荒元尊霸体诀。\n据说。\n乃是开天辟地的时候，洪荒时代第一强者\u2018元尊\u2019的无上绝学。\n元尊。\n一个号称超越了大帝，不死不灭的无上存在。\n叶飞得到了他的无上绝学后，开篇第一句话就叫：破而后立。\n叶飞最后苦思冥想，终于在两年前，察觉到了破而后立到底是什么意思。\n那就是散去自己的真元，将自己彻底的变成一个废人。\n然后，利用洪荒元尊霸体诀来挖掘人体潜力，开辟出一条全新的修炼门户，修炼出元尊之力。\n如此以往下去，当将洪荒元尊霸体诀修炼到极致的时候，就可以打破帝境，成为开天辟地以来的第二位元尊。\n成为不死不灭的存在。\n哪怕天地毁灭，他也可以与世长存。\n但是，他不敢赌。\n毕竟，他是天才。\n要他成为一个废人。\n换做是谁，也无法下定决心。\n直到一年前，自己的心爱之人李月茹在火云山中了火毒后，命悬一线，需要精元去驱除火毒。\n那个时候，他才终于下定了决定。\n用自己体内的精元之力，去驱除李月茹体内的火毒。\n\u201c我的修为，还是锻体境一重天初期。体内的精元之力，还没有完全剔除，剔除干净后，应该就可以打开一道元尊门户，修炼出一丝元尊之力了吧？\u201d叶飞暗暗道。\n他现在的体内，已经有了一点元尊之气。\n那元尊之气，微不足道。\n但总算还是可以感应得到。但要将元尊之气，化为元尊之力，那就得将洪荒元尊霸体诀修炼到第一层，打开第一道元尊之门才行。\n\u201c最重要的是，我的所有精元全部散去，应该可以将月儿体内的火毒彻底铲除，到了那个时候，月儿必然可以成为一元境的天才，修为也可以更进一步，甚至成为外宗的第一天才也未尝不可？\u201d叶飞的脑袋里，浮现出了一个紫衣女子的模样，脸上顿时荡漾出了幸福的笑容。\n他打定注意。\n等这次月儿体内火毒彻底驱除后，他就将洪荒元尊霸体诀传授给她。\n\u201c你看，这傻子走了。\u201d\n\u201c唉，看他那高兴的模样，肯定又是去给李月茹驱除体内的火毒。\u201d\n\u201c我上次在枯木林看到李月茹与我们外宗的第二天才\u2026\u2026不，应该说是如今外宗的第一天才郝月华抱在了一起，而且还卿卿我我了好长一段时间，这傻子被蒙在鼓里，上次我告诉他，他还不信\u2026\u2026\u201d\n\u201c真的假的啊？\u201d\n\u2026\u2026 没多久。\n叶飞来到了外宗后山的枯木林。\n就看到一个紫衣女子，站在不远处。\n这个女子，正是李月茹。\n外宗第一美人。\n\u201c叶飞哥哥，你终于来了，月儿等你很久了。\u201d李月茹看到叶飞，顿时笑面如花。\n\u201c月茹，你赶紧坐下，我帮你炼化体内的最后一丝火毒，到那个时候，你的修为，甚至是资质，还可以更进一步，成为我们外宗第一天才。\u201d叶飞一脸温和的看着李月茹笑道。\n比起洪荒元尊霸体诀，他更在意李月茹。\n不然，他也不会下定决心，用自己的修为与资质去驱除李月茹体内的火毒。\n\u201c叶飞哥哥，你真好，等月儿体内的火毒驱除之后，我就跟你回去跟叶叔叔还有我父亲他们说，选一个良辰吉日，与你把婚事给订下来。\u201d李月茹上前一步，啵的一声，在叶飞的脸上亲了一下。\n叶飞顿时大喜，抓着李月茹的手，满是激动的道：\u201c月儿，你终于答应要与我订婚了吗？\u201d\n他从小就喜欢李月茹，也梦想有一天李月茹嫁给自己，现在，终于等到了李月茹这句话。\n\u201c那当然。\u201d李月茹嫣然一笑。\n立马坐了下来。\n叶飞深吸了口气，压下了心头的激动，暗暗道：\u201c月儿，你放心吧，我娶了你后，一定会让你幸福，我还要让你在将来，与我一起修炼洪荒元尊霸体诀，成为不死不灭的存在。\u201d\n叶飞眸光一闪，双手搭在了李月茹的后背，开始将自己体内最后的精元，不断的往李月茹的体内输送。\n随着精元的输送，叶飞的脸色，越发的苍白。、\n到了后来。噗的一声，他一口鲜血喷出，体内的精元，全部消散。\n此刻，他已经成为了一个彻底的废人。\n但这一刻，他的体内，那一丝元尊之气，却微微颤抖了一下。\n一道黑色的门户，在他原本的丹田处，隐隐约约出现了。\n\u201c嘻嘻，我的火毒终于完全驱除了，不仅如此，我的修为更进一步，踏入了锻体境五重天巅峰。\u201d李月茹站起身来，感受了一下体内那更强的力量，顿时大喜了起来。\n看到欣喜若狂的李月茹，叶飞脸上，也是涌现出了几分喜悦。\n自己的付出，总算是没有白费。\n\u201c月儿，恭喜你了，剔除火毒，修为更进一步。\u201d就在这个时候，一个白衣少年大笑着走了出来。\n看到这白衣少年，叶飞笑着的脸色，顿时猛的一变。\n这个白衣少年，名为郝月华，乃是他的死对头。\n可现在，他看到了什么？\n他的死对手走了过来，一把抱住了自己心爱的女人。\n而李月茹，却仿若没有看到他一样，居然一脸羞涩的扑入了郝月华的怀里。\n\u201c你们\u2026\u2026\u201d看到这一幕，叶飞浑身一颤，如遭雷击，脑袋嗡嗡作响。"}
     */

    private boolean ok;
    private ChapterBean chapter;

    public boolean isOk() {
        return ok;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterBean getChapter() {
        return chapter;
    }

    public void setChapter(ChapterBean chapter) {
        this.chapter = chapter;
    }
    @Entity
    public static class ChapterBean {
        @Id(autoincrement = true)
        private long id;
        public String _id;
        private String title;
        private String body;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public long getId() {
            return id;
        }

        public void setId(long id) {
            this.id = id;
        }

        public String get_id() {
            return _id;
        }

        public void set_id(String _id) {
            this._id = _id;
        }

        public void setBody(String body) {
            this.body = body;
        }
    }
}
